PH_data/alpha_1.1/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
19484
(
( 2.840967863e-05 -5.829238944e-06 4.415967112e-07 1.442986922e-05 -3.846266168e-07 2.789946666e-05 )
( 2.829091136e-05 -4.219110906e-06 1.553561617e-07 1.076827084e-05 -3.689681307e-07 2.840762136e-05 )
( 2.859075721e-05 -5.938061349e-06 3.8879881e-07 1.469767176e-05 -3.611922921e-07 2.788632264e-05 )
( 2.845474046e-05 -3.343822527e-06 1.278278106e-08 8.551509382e-06 -3.160050142e-07 2.840972775e-05 )
( 2.84587677e-05 -4.319319942e-06 7.469454744e-08 1.099073688e-05 -3.375334927e-07 2.838283763e-05 )
( 2.844165647e-05 -3.336534974e-06 1.764592383e-08 8.536075256e-06 -3.176555197e-07 2.840760499e-05 )
( 2.901213338e-05 -7.012579317e-06 4.874830211e-07 1.689643614e-05 -3.244949482e-07 2.752452929e-05 )
( 2.875661448e-05 -6.042262612e-06 3.422812256e-07 1.496310233e-05 -3.427811635e-07 2.790330109e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
